import type { Role } from '../types';

export const HEROES: Record<Role, string[]> = {
  tank: [
    'D.Va', '둠피스트', '라마트라', '라인하르트', '레킹볼',
    '로드호그', '마우가', '오리사', '시그마', '윈스턴',
    '자리야', '정커퀸', '해저드', '시에라', '도미나', '우양',
  ],
  dps: [
    '겐지', '리퍼', '메이', '바스티온', '벤처',
    '소전', '솔저: 76', '솜브라', '시메트라', '애쉬',
    '에코', '위도우메이커', '정크랫', '캐서디', '토르비욘',
    '트레이서', '파라', '한조', '미즈키', '엠레', '제트팩 캣',
  ],
  heal: [
    '아나', '바티스트', '브리기테', '일리아리', '주노',
    '키리코', '라이프위버', '루시우', '메르시', '모이라',
    '젠야타', '안란', '프레야',
  ],
};
